/*
 * SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
 * Copyright(c) 2013 by LG Electronics Inc.
 * 
 * This program is free software; you can redistribute it and/or 
 * modify it under the terms of the GNU General Public License 
 * version 2 as published by the Free Software Foundation.
 * 
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of 
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
 * GNU General Public License for more details.
 */

#include "reg_types.h"

#ifndef __VID0_UNION_REG_H
#define __VID0_UNION_REG_H


/*----------------------------------------------------------------------------
	0x31000000 vid0_rd_cfg0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_en                                           : 1; /* 0 */
		u32 src_dst_sel                                      : 1; /* 1 */
		u32 src_dual_op_en                                   : 1; /* 2 */
		u32 reserved3                                        : 1; /* 3 */
		u32 src_buf_sel                                      : 2; /* 5:4 */
		u32 src_trans_num                                    : 2; /* 7:6 */
		u32 src_sync_sel                                     : 2; /* 9:8 */
		u32 reserved7                                        : 2; /* 11:10 */
		u32 src_reg_sw_update                                : 1; /* 12 */
		u32 reserved9                                        :19; /* 31:13 */
	} af;
	u32 a32;
} vid0_rd_cfg0;

/*----------------------------------------------------------------------------
	0x31000004 vid0_rd_cfg1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_format                                       : 4; /* 3:0 */
		u32 src_byte_swap                                    : 2; /* 5:4 */
		u32 src_word_swap                                    : 1; /* 6 */
		u32 src_alpha_swap                                   : 1; /* 7 */
		u32 src_rgb_swap                                     : 3; /* 10:8 */
		u32 src_yuv_swap                                     : 1; /* 11 */
		u32 reserved6                                        : 2; /* 13:12 */
		u32 src_lsb_sel                                      : 1; /* 14 */
		u32 reserved8                                        : 2; /* 16:15 */
		u32 src_bnd_fill_mode                                : 1; /* 17 */
		u32 src_vscale_mode                                  : 1; /* 18 */
		u32 src_scl_bp_mode                                  : 1; /* 19 */
		u32 src_flip_mode                                    : 2; /* 21:20 */
		u32 reserved13                                       :10; /* 31:22 */
	} af;
	u32 a32;
} vid0_rd_cfg1;

/*----------------------------------------------------------------------------
	0x31000008 vid0_rd_cfg2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_fr_xd_re_path_sel                            : 1; /* 0 */
		u32 src_to_xd_re_path_sel                            : 1; /* 1 */
		u32 src_fr_xd_nr_path_sel                            : 1; /* 2 */
		u32 src_to_xd_nr_path_sel                            : 1; /* 3 */
		u32 reserved4                                        : 4; /* 7:4 */
		u32 vid_xd_path_en                                   : 1; /* 8 */
		u32 reserved6                                        :23; /* 31:9 */
	} af;
	u32 a32;
} vid0_rd_cfg2;

/*----------------------------------------------------------------------------
	0x31000028 vid0_rd_width_height
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_width                                        :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 src_height                                       :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid0_rd_width_height;

/*----------------------------------------------------------------------------
	0x3100002c vid0_rd_startxy
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_sx                                           :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 src_sy                                           :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid0_rd_startxy;

/*----------------------------------------------------------------------------
	0x31000030 vid0_rd_sizexy
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_sizex                                        :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 src_sizey                                        :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid0_rd_sizexy;

/*----------------------------------------------------------------------------
	0x31000038 vid0_rd_pip_sizexy
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_pip_sizex                                    :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 src_pip_sizey                                    :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid0_rd_pip_sizexy;

/*----------------------------------------------------------------------------
	0x3100003c vid0_rd_scale_ratioxy
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_x_ratio                                      :16; /* 15:0 */
		u32 src_y_ratio                                      :16; /* 31:16 */
	} af;
	u32 a32;
} vid0_rd_scale_ratioxy;

/*----------------------------------------------------------------------------
	0x31000040 vid0_rd_dss_base_y_addr0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_y0                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_rd_dss_base_y_addr0;

/*----------------------------------------------------------------------------
	0x31000044 vid0_rd_dss_base_u_addr0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_u0                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_rd_dss_base_u_addr0;

/*----------------------------------------------------------------------------
	0x31000048 vid0_rd_dss_base_v_addr0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_v0                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_rd_dss_base_v_addr0;

/*----------------------------------------------------------------------------
	0x3100004c vid0_rd_dss_base_y_addr1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_y1                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_rd_dss_base_y_addr1;

/*----------------------------------------------------------------------------
	0x31000050 vid0_rd_dss_base_u_addr1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_u1                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_rd_dss_base_u_addr1;

/*----------------------------------------------------------------------------
	0x31000054 vid0_rd_dss_base_v_addr1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_v1                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_rd_dss_base_v_addr1;

/*----------------------------------------------------------------------------
	0x31000058 vid0_rd_dss_base_y_addr2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_y2                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_rd_dss_base_y_addr2;

/*----------------------------------------------------------------------------
	0x3100005c vid0_rd_dss_base_u_addr2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_u2                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_rd_dss_base_u_addr2;

/*----------------------------------------------------------------------------
	0x31000060 vid0_rd_dss_base_v_addr2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_v2                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_rd_dss_base_v_addr2;

/*----------------------------------------------------------------------------
	0x31000064 vid0_rd_status
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 rdmif_full_cmdfifo                               : 1; /* 0 */
		u32 rdmif_full_datfifo                               : 1; /* 1 */
		u32 reserved2                                        : 2; /* 3:2 */
		u32 rdmif_empty_cmdfifo                              : 1; /* 4 */
		u32 rdmif_empty_datfifo                              : 1; /* 5 */
		u32 reserved5                                        : 2; /* 7:6 */
		u32 rdbif_full_datfifo_y                             : 1; /* 8 */
		u32 rdbif_full_datfifo_u                             : 1; /* 9 */
		u32 rdbif_full_datfifo_v                             : 1; /* 10 */
		u32 reserved9                                        : 1; /* 11 */
		u32 rdbif_empty_datfifo_y                            : 1; /* 12 */
		u32 rdbif_empty_datfifo_u                            : 1; /* 13 */
		u32 rdbif_empty_datfifo_v                            : 1; /* 14 */
		u32 reserved13                                       : 1; /* 15 */
		u32 rdbif_con_state_y                                : 1; /* 16 */
		u32 rdbif_con_state_u                                : 1; /* 17 */
		u32 rdbif_con_state_v                                : 1; /* 18 */
		u32 rdbif_con_sync_state                             : 1; /* 19 */
		u32 rdbif_fmc_y_state                                : 1; /* 20 */
		u32 rdbif_fmc_uv_state                               : 1; /* 21 */
		u32 rdbif_fmc_sync_state                             : 1; /* 22 */
		u32 reserved21                                       : 1; /* 23 */
		u32 scl_vsc_wr_state                                 : 1; /* 24 */
		u32 scl_vsc_rd_state                                 : 1; /* 25 */
		u32 scl_hsc_wr_state                                 : 1; /* 26 */
		u32 scl_hsc_rd_state                                 : 1; /* 27 */
		u32 reserved26                                       : 4; /* 31:28 */
	} af;
	u32 a32;
} vid0_rd_status;

/*----------------------------------------------------------------------------
	0x31000190 vid0_wb_cfg0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_en                                            : 1; /* 0 */
		u32 wb_alpha_reg_en                                  : 1; /* 1 */
		u32 reserved2                                        : 2; /* 3:2 */
		u32 wb_buf_sel                                       : 1; /* 4 */
		u32 reserved4                                        : 3; /* 7:5 */
		u32 wb_sync_sel                                      : 2; /* 9:8 */
		u32 wb_reg_sw_update                                 : 1; /* 12 */
		u32 reserved7                                        :19; /* 31:13 */
	} af;
	u32 a32;
} vid0_wb_cfg0;

/*----------------------------------------------------------------------------
	0x31000194 vid0_wb_cfg1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_format                                        : 4; /* 3:0 */
		u32 wb_byte_swap                                     : 2; /* 5:4 */
		u32 wb_word_swap                                     : 1; /* 6 */
		u32 wb_alpha_swap                                    : 1; /* 7 */
		u32 wb_rgb_swap                                      : 3; /* 10:8 */
		u32 wb_yuv_swap                                      : 1; /* 11 */
		u32 reserved6                                        : 4; /* 15:12 */
		u32 wb_src_sel                                       : 1; /* 16 */
		u32 reserved8                                        :15; /* 31:17 */
	} af;
	u32 a32;
} vid0_wb_cfg1;

/*----------------------------------------------------------------------------
	0x310001b8 vid0_wb_alpha_value
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_alpha                                         : 8; /* 7:0 */
		u32 reserved1                                        :24; /* 31:8 */
	} af;
	u32 a32;
} vid0_wb_alpha_value;

/*----------------------------------------------------------------------------
	0x310001bc vid0_wb_width_height
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_width                                         :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 wb_height                                        :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid0_wb_width_height;

/*----------------------------------------------------------------------------
	0x310001c0 vid0_wb_startxy
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_sx                                            :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 wb_sy                                            :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid0_wb_startxy;

/*----------------------------------------------------------------------------
	0x310001c4 vid0_wb_sizexy
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_sizex                                         :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 wb_sizey                                         :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid0_wb_sizexy;

/*----------------------------------------------------------------------------
	0x310001cc vid0_wb_dss_base_y_addr0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_st_addr_y0                                    :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_wb_dss_base_y_addr0;

/*----------------------------------------------------------------------------
	0x310001d0 vid0_wb_dss_base_u_addr0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_st_addr_u0                                    :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_wb_dss_base_u_addr0;

/*----------------------------------------------------------------------------
	0x310001d8 vid0_wb_dss_base_y_addr1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_st_addr_y1                                    :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_wb_dss_base_y_addr1;

/*----------------------------------------------------------------------------
	0x310001dc vid0_wb_dss_base_u_addr1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_st_addr_u1                                    :32; /* 31:0 */
	} af;
	u32 a32;
} vid0_wb_dss_base_u_addr1;

/*----------------------------------------------------------------------------
	0x310001e4 vid0_wb_status
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wrctrl_full_inf_fifoy                            : 1; /* 0 */
		u32 wrctrl_full_inf_fifou                            : 1; /* 1 */
		u32 wrctrl_full_inf_fifov                            : 1; /* 2 */
		u32 reserved3                                        : 1; /* 3 */
		u32 wrctrl_empty_inf_fifoy                           : 1; /* 4 */
		u32 wrctrl_empty_inf_fifou                           : 1; /* 5 */
		u32 wrctrl_empty_inf_fifov                           : 1; /* 6 */
		u32 reserved7                                        : 1; /* 7 */
		u32 wrctrl_con_y_state                               : 1; /* 8 */
		u32 wrctrl_con_u_state                               : 1; /* 9 */
		u32 wrctrl_con_v_state                               : 1; /* 10 */
		u32 wrctrl_con_sync_state                            : 1; /* 11 */
		u32 wrmif_full_cmdfifo                               : 1; /* 12 */
		u32 wrmif_full_datfifo                               : 1; /* 13 */
		u32 reserved14                                       : 2; /* 15:14 */
		u32 wrmif_empty_cmdfifo                              : 1; /* 16 */
		u32 wrmif_empty_datfifo                              : 1; /* 17 */
		u32 reserved17                                       :14; /* 31:18 */
	} af;
	u32 a32;
} vid0_wb_status;

/*----------------------------------------------------------------------------
	0x31000500 vid0_poly_hcoef_12t_0p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_0p_m5_hcoef                                   : 9; /* 8:0 */
		u32 pp_0p_m4_hcoef                                   : 9; /* 17:9 */
		u32 pp_0p_m3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_0p0;

/*----------------------------------------------------------------------------
	0x31000504 vid0_poly_hcoef_12t_0p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_0p_m2_hcoef                                   : 9; /* 8:0 */
		u32 pp_0p_m1_hcoef                                   : 9; /* 17:9 */
		u32 pp_0p_p0_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_0p1;

/*----------------------------------------------------------------------------
	0x31000508 vid0_poly_hcoef_12t_0p2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_0p_p1_hcoef                                   : 9; /* 8:0 */
		u32 pp_0p_p2_hcoef                                   : 9; /* 17:9 */
		u32 pp_0p_p3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_0p2;

/*----------------------------------------------------------------------------
	0x3100050c vid0_poly_hcoef_12t_0p3
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_0p_p4_hcoef                                   : 9; /* 8:0 */
		u32 pp_0p_p5_hcoef                                   : 9; /* 17:9 */
		u32 pp_0p_p6_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_0p3;

/*----------------------------------------------------------------------------
	0x31000510 vid0_poly_hcoef_12t_1p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_1p_m5_hcoef                                   : 9; /* 8:0 */
		u32 pp_1p_m4_hcoef                                   : 9; /* 17:9 */
		u32 pp_1p_m3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_1p0;

/*----------------------------------------------------------------------------
	0x31000514 vid0_poly_hcoef_12t_1p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_1p_m2_hcoef                                   : 9; /* 8:0 */
		u32 pp_1p_m1_hcoef                                   : 9; /* 17:9 */
		u32 pp_1p_p0_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_1p1;

/*----------------------------------------------------------------------------
	0x31000518 vid0_poly_hcoef_12t_1p2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_1p_p1_hcoef                                   : 9; /* 8:0 */
		u32 pp_1p_p2_hcoef                                   : 9; /* 17:9 */
		u32 pp_1p_p3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_1p2;

/*----------------------------------------------------------------------------
	0x3100051c vid0_poly_hcoef_12t_1p3
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_1p_p4_hcoef                                   : 9; /* 8:0 */
		u32 pp_1p_p5_hcoef                                   : 9; /* 17:9 */
		u32 pp_1p_p6_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_1p3;

/*----------------------------------------------------------------------------
	0x31000520 vid0_poly_hcoef_12t_2p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_2p_m5_hcoef                                   : 9; /* 8:0 */
		u32 pp_2p_m4_hcoef                                   : 9; /* 17:9 */
		u32 pp_2p_m3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_2p0;

/*----------------------------------------------------------------------------
	0x31000524 vid0_poly_hcoef_12t_2p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_2p_m2_hcoef                                   : 9; /* 8:0 */
		u32 pp_2p_m1_hcoef                                   : 9; /* 17:9 */
		u32 pp_2p_p0_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_2p1;

/*----------------------------------------------------------------------------
	0x31000528 vid0_poly_hcoef_12t_2p2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_2p_p1_hcoef                                   : 9; /* 8:0 */
		u32 pp_2p_p2_hcoef                                   : 9; /* 17:9 */
		u32 pp_2p_p3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_2p2;

/*----------------------------------------------------------------------------
	0x3100052c vid0_poly_hcoef_12t_2p3
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_2p_p4_hcoef                                   : 9; /* 8:0 */
		u32 pp_2p_p5_hcoef                                   : 9; /* 17:9 */
		u32 pp_2p_p6_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_2p3;

/*----------------------------------------------------------------------------
	0x31000530 vid0_poly_hcoef_12t_3p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_3p_m5_hcoef                                   : 9; /* 8:0 */
		u32 pp_3p_m4_hcoef                                   : 9; /* 17:9 */
		u32 pp_3p_m3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_3p0;

/*----------------------------------------------------------------------------
	0x31000534 vid0_poly_hcoef_12t_3p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_3p_m2_hcoef                                   : 9; /* 8:0 */
		u32 pp_3p_m1_hcoef                                   : 9; /* 17:9 */
		u32 pp_3p_p0_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_3p1;

/*----------------------------------------------------------------------------
	0x31000538 vid0_poly_hcoef_12t_3p2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_3p_p1_hcoef                                   : 9; /* 8:0 */
		u32 pp_3p_p2_hcoef                                   : 9; /* 17:9 */
		u32 pp_3p_p3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_3p2;

/*----------------------------------------------------------------------------
	0x3100053c vid0_poly_hcoef_12t_3p3
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_3p_p4_hcoef                                   : 9; /* 8:0 */
		u32 pp_3p_p5_hcoef                                   : 9; /* 17:9 */
		u32 pp_3p_p6_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_3p3;

/*----------------------------------------------------------------------------
	0x31000540 vid0_poly_hcoef_12t_4p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_4p_m5_hcoef                                   : 9; /* 8:0 */
		u32 pp_4p_m4_hcoef                                   : 9; /* 17:9 */
		u32 pp_4p_m3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_4p0;

/*----------------------------------------------------------------------------
	0x31000544 vid0_poly_hcoef_12t_4p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_4p_m2_hcoef                                   : 9; /* 8:0 */
		u32 pp_4p_m1_hcoef                                   : 9; /* 17:9 */
		u32 pp_4p_p0_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_4p1;

/*----------------------------------------------------------------------------
	0x31000548 vid0_poly_hcoef_12t_4p2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_4p_p1_hcoef                                   : 9; /* 8:0 */
		u32 pp_4p_p2_hcoef                                   : 9; /* 17:9 */
		u32 pp_4p_p3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_4p2;

/*----------------------------------------------------------------------------
	0x3100054c vid0_poly_hcoef_12t_4p3
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_4p_p4_hcoef                                   : 9; /* 8:0 */
		u32 pp_4p_p5_hcoef                                   : 9; /* 17:9 */
		u32 pp_4p_p6_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_4p3;

/*----------------------------------------------------------------------------
	0x31000550 vid0_poly_hcoef_12t_5p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_5p_m5_hcoef                                   : 9; /* 8:0 */
		u32 pp_5p_m4_hcoef                                   : 9; /* 17:9 */
		u32 pp_5p_m3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_5p0;

/*----------------------------------------------------------------------------
	0x31000554 vid0_poly_hcoef_12t_5p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_5p_m2_hcoef                                   : 9; /* 8:0 */
		u32 pp_5p_m1_hcoef                                   : 9; /* 17:9 */
		u32 pp_5p_p0_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_5p1;

/*----------------------------------------------------------------------------
	0x31000558 vid0_poly_hcoef_12t_5p2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_5p_p1_hcoef                                   : 9; /* 8:0 */
		u32 pp_5p_p2_hcoef                                   : 9; /* 17:9 */
		u32 pp_5p_p3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_5p2;

/*----------------------------------------------------------------------------
	0x3100055c vid0_poly_hcoef_12t_5p3
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_5p_p4_hcoef                                   : 9; /* 8:0 */
		u32 pp_5p_p5_hcoef                                   : 9; /* 17:9 */
		u32 pp_5p_p6_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_5p3;

/*----------------------------------------------------------------------------
	0x31000560 vid0_poly_hcoef_12t_6p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_6p_m5_hcoef                                   : 9; /* 8:0 */
		u32 pp_6p_m4_hcoef                                   : 9; /* 17:9 */
		u32 pp_6p_m3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_6p0;

/*----------------------------------------------------------------------------
	0x31000564 vid0_poly_hcoef_12t_6p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_6p_m2_hcoef                                   : 9; /* 8:0 */
		u32 pp_6p_m1_hcoef                                   : 9; /* 17:9 */
		u32 pp_6p_p0_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_6p1;

/*----------------------------------------------------------------------------
	0x31000568 vid0_poly_hcoef_12t_6p2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_6p_p1_hcoef                                   : 9; /* 8:0 */
		u32 pp_6p_p2_hcoef                                   : 9; /* 17:9 */
		u32 pp_6p_p3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_6p2;

/*----------------------------------------------------------------------------
	0x3100056c vid0_poly_hcoef_12t_6p3
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_6p_p4_hcoef                                   : 9; /* 8:0 */
		u32 pp_6p_p5_hcoef                                   : 9; /* 17:9 */
		u32 pp_6p_p6_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_6p3;

/*----------------------------------------------------------------------------
	0x31000570 vid0_poly_hcoef_12t_7p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_7p_m5_hcoef                                   : 9; /* 8:0 */
		u32 pp_7p_m4_hcoef                                   : 9; /* 17:9 */
		u32 pp_7p_m3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_7p0;

/*----------------------------------------------------------------------------
	0x31000574 vid0_poly_hcoef_12t_7p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_7p_m2_hcoef                                   : 9; /* 8:0 */
		u32 pp_7p_m1_hcoef                                   : 9; /* 17:9 */
		u32 pp_7p_p0_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_7p1;

/*----------------------------------------------------------------------------
	0x31000578 vid0_poly_hcoef_12t_7p2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_7p_p1_hcoef                                   : 9; /* 8:0 */
		u32 pp_7p_p2_hcoef                                   : 9; /* 17:9 */
		u32 pp_7p_p3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_7p2;

/*----------------------------------------------------------------------------
	0x3100057c vid0_poly_hcoef_12t_7p3
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_7p_p4_hcoef                                   : 9; /* 8:0 */
		u32 pp_7p_p5_hcoef                                   : 9; /* 17:9 */
		u32 pp_7p_p6_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_hcoef_12t_7p3;

/*----------------------------------------------------------------------------
	0x31000600 vid0_poly_vcoef_4t_0p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_0p_m1_vcoef                                   : 9; /* 8:0 */
		u32 pp_0p_p0_vcoef                                   : 9; /* 17:9 */
		u32 pp_0p_p1_vcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_0p0;

/*----------------------------------------------------------------------------
	0x31000604 vid0_poly_vcoef_4t_0p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_0p_p2_vcoef                                   : 9; /* 8:0 */
		u32 reserved1                                        :23; /* 31:9 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_0p1;

/*----------------------------------------------------------------------------
	0x31000608 vid0_poly_vcoef_4t_1p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_1p_m1_vcoef                                   : 9; /* 8:0 */
		u32 pp_1p_p0_vcoef                                   : 9; /* 17:9 */
		u32 pp_1p_p1_vcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_1p0;

/*----------------------------------------------------------------------------
	0x3100060c vid0_poly_vcoef_4t_1p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_1p_p2_vcoef                                   : 9; /* 8:0 */
		u32 reserved1                                        :23; /* 31:9 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_1p1;

/*----------------------------------------------------------------------------
	0x31000610 vid0_poly_vcoef_4t_2p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_2p_m1_vcoef                                   : 9; /* 8:0 */
		u32 pp_2p_p0_vcoef                                   : 9; /* 17:9 */
		u32 pp_2p_p1_vcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_2p0;

/*----------------------------------------------------------------------------
	0x31000614 vid0_poly_vcoef_4t_2p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_2p_p2_vcoef                                   : 9; /* 8:0 */
		u32 reserved1                                        :23; /* 31:9 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_2p1;

/*----------------------------------------------------------------------------
	0x31000618 vid0_poly_vcoef_4t_3p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_3p_m1_vcoef                                   : 9; /* 8:0 */
		u32 pp_3p_p0_vcoef                                   : 9; /* 17:9 */
		u32 pp_3p_p1_vcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_3p0;

/*----------------------------------------------------------------------------
	0x3100061c vid0_poly_vcoef_4t_3p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_3p_p2_vcoef                                   : 9; /* 8:0 */
		u32 reserved1                                        :23; /* 31:9 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_3p1;

/*----------------------------------------------------------------------------
	0x31000620 vid0_poly_vcoef_4t_4p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_4p_m1_vcoef                                   : 9; /* 8:0 */
		u32 pp_4p_p0_vcoef                                   : 9; /* 17:9 */
		u32 pp_4p_p1_vcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_4p0;

/*----------------------------------------------------------------------------
	0x31000624 vid0_poly_vcoef_4t_4p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_4p_p2_vcoef                                   : 9; /* 8:0 */
		u32 reserved1                                        :23; /* 31:9 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_4p1;

/*----------------------------------------------------------------------------
	0x31000628 vid0_poly_vcoef_4t_5p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_5p_m1_vcoef                                   : 9; /* 8:0 */
		u32 pp_5p_p0_vcoef                                   : 9; /* 17:9 */
		u32 pp_5p_p1_vcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_5p0;

/*----------------------------------------------------------------------------
	0x3100062c vid0_poly_vcoef_4t_5p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_5p_p2_vcoef                                   : 9; /* 8:0 */
		u32 reserved1                                        :23; /* 31:9 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_5p1;

/*----------------------------------------------------------------------------
	0x31000630 vid0_poly_vcoef_4t_6p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_6p_m1_vcoef                                   : 9; /* 8:0 */
		u32 pp_6p_p0_vcoef                                   : 9; /* 17:9 */
		u32 pp_6p_p1_vcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_6p0;

/*----------------------------------------------------------------------------
	0x31000634 vid0_poly_vcoef_4t_6p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_6p_p2_vcoef                                   : 9; /* 8:0 */
		u32 reserved1                                        :23; /* 31:9 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_6p1;

/*----------------------------------------------------------------------------
	0x31000638 vid0_poly_vcoef_4t_7p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_7p_m1_vcoef                                   : 9; /* 8:0 */
		u32 pp_7p_p0_vcoef                                   : 9; /* 17:9 */
		u32 pp_7p_p1_vcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_7p0;

/*----------------------------------------------------------------------------
	0x3100063c vid0_poly_vcoef_4t_7p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_7p_p2_vcoef                                   : 9; /* 8:0 */
		u32 reserved1                                        :23; /* 31:9 */
	} af;
	u32 a32;
} vid0_poly_vcoef_4t_7p1;

typedef struct {
	vid0_rd_cfg0                  	i0_rd_cfg0;		/* 0x0 */
	vid0_rd_cfg1                  	i0_rd_cfg1;		/* 0x4 */
	vid0_rd_cfg2                  	i0_rd_cfg2;		/* 0x8 */
	unsigned int 			reserved_[7];
	vid0_rd_width_height          	i0_rd_width_height;	/* 0x28 */
	vid0_rd_startxy               	i0_rd_startxy;		/* 0x2C */
	vid0_rd_sizexy                	i0_rd_sizexy;		/* 0x30 */
	unsigned int 			reserved_1;
	vid0_rd_pip_sizexy            	i0_rd_pip_sizexy;	/* 0x38 */
	vid0_rd_scale_ratioxy         	i0_rd_scale_ratioxy;	/* 0x3C */
	vid0_rd_dss_base_y_addr0      	i0_rd_dss_base_y_addr0; /* 0x40 */
	vid0_rd_dss_base_u_addr0      	i0_rd_dss_base_u_addr0;	/* 0x44 */
	vid0_rd_dss_base_v_addr0      	i0_rd_dss_base_v_addr0;	/* 0x48 */
	vid0_rd_dss_base_y_addr1      	i0_rd_dss_base_y_addr1;	/* 0x4C */
	vid0_rd_dss_base_u_addr1      	i0_rd_dss_base_u_addr1;	/* 0x50 */
	vid0_rd_dss_base_v_addr1      	i0_rd_dss_base_v_addr1;	/* 0x54 */
	vid0_rd_dss_base_y_addr2      	i0_rd_dss_base_y_addr2;	/* 0x58 */
	vid0_rd_dss_base_u_addr2      	i0_rd_dss_base_u_addr2;	/* 0x5C */
	vid0_rd_dss_base_v_addr2      	i0_rd_dss_base_v_addr2;	/* 0x60 */
	vid0_rd_status                	i0_rd_status;		/* 0x64 */
	unsigned int 			reserved_2[74];
	vid0_wb_cfg0                  	i0_wb_cfg0;		/* 0x190 */
	vid0_wb_cfg1                  	i0_wb_cfg1;		/* 0x194 */
	unsigned int 			reserved_3[8];
	vid0_wb_alpha_value           	i0_wb_alpha_value;	/* 0x1B8 */
	vid0_wb_width_height          	i0_wb_width_height;
	vid0_wb_startxy               	i0_wb_startxy;
	vid0_wb_sizexy                	i0_wb_sizexy;		/* 0x1C4 */
	unsigned int 			reserved_4;
	vid0_wb_dss_base_y_addr0      	i0_wb_dss_base_y_addr0;	/* 0x1CC */
	vid0_wb_dss_base_u_addr0      	i0_wb_dss_base_u_addr0;
	unsigned int 			reserved_5;
	vid0_wb_dss_base_y_addr1      	i0_wb_dss_base_y_addr1;	/* 0x1D8 */
	vid0_wb_dss_base_u_addr1      	i0_wb_dss_base_u_addr1;
	unsigned int 			reserved_6;
	vid0_wb_status                	i0_wb_status;		/* 0x1E4 */
	unsigned int 			reserved_7[198];
	vid0_poly_hcoef_12t_0p0       	i0_poly_hcoef_12t_0p0;	/* 0x500 */
	vid0_poly_hcoef_12t_0p1       	i0_poly_hcoef_12t_0p1;
	vid0_poly_hcoef_12t_0p2       	i0_poly_hcoef_12t_0p2;
	vid0_poly_hcoef_12t_0p3       	i0_poly_hcoef_12t_0p3;
	vid0_poly_hcoef_12t_1p0       	i0_poly_hcoef_12t_1p0;
	vid0_poly_hcoef_12t_1p1       	i0_poly_hcoef_12t_1p1;
	vid0_poly_hcoef_12t_1p2       	i0_poly_hcoef_12t_1p2;
	vid0_poly_hcoef_12t_1p3       	i0_poly_hcoef_12t_1p3;
	vid0_poly_hcoef_12t_2p0       	i0_poly_hcoef_12t_2p0;
	vid0_poly_hcoef_12t_2p1       	i0_poly_hcoef_12t_2p1;
	vid0_poly_hcoef_12t_2p2       	i0_poly_hcoef_12t_2p2;
	vid0_poly_hcoef_12t_2p3       	i0_poly_hcoef_12t_2p3;
	vid0_poly_hcoef_12t_3p0       	i0_poly_hcoef_12t_3p0;
	vid0_poly_hcoef_12t_3p1       	i0_poly_hcoef_12t_3p1;
	vid0_poly_hcoef_12t_3p2       	i0_poly_hcoef_12t_3p2;
	vid0_poly_hcoef_12t_3p3       	i0_poly_hcoef_12t_3p3;
	vid0_poly_hcoef_12t_4p0       	i0_poly_hcoef_12t_4p0;
	vid0_poly_hcoef_12t_4p1       	i0_poly_hcoef_12t_4p1;
	vid0_poly_hcoef_12t_4p2       	i0_poly_hcoef_12t_4p2;
	vid0_poly_hcoef_12t_4p3       	i0_poly_hcoef_12t_4p3;
	vid0_poly_hcoef_12t_5p0       	i0_poly_hcoef_12t_5p0;
	vid0_poly_hcoef_12t_5p1       	i0_poly_hcoef_12t_5p1;
	vid0_poly_hcoef_12t_5p2       	i0_poly_hcoef_12t_5p2;
	vid0_poly_hcoef_12t_5p3       	i0_poly_hcoef_12t_5p3;
	vid0_poly_hcoef_12t_6p0       	i0_poly_hcoef_12t_6p0;
	vid0_poly_hcoef_12t_6p1       	i0_poly_hcoef_12t_6p1;
	vid0_poly_hcoef_12t_6p2       	i0_poly_hcoef_12t_6p2;
	vid0_poly_hcoef_12t_6p3       	i0_poly_hcoef_12t_6p3;
	vid0_poly_hcoef_12t_7p0       	i0_poly_hcoef_12t_7p0;
	vid0_poly_hcoef_12t_7p1       	i0_poly_hcoef_12t_7p1;
	vid0_poly_hcoef_12t_7p2       	i0_poly_hcoef_12t_7p2;
	vid0_poly_hcoef_12t_7p3       	i0_poly_hcoef_12t_7p3;	/* 0x57C */
	unsigned int 			reserved_8[32];
	vid0_poly_vcoef_4t_0p0        	i0_poly_vcoef_4t_0p0;	/* 0x600 */
	vid0_poly_vcoef_4t_0p1        	i0_poly_vcoef_4t_0p1;
	vid0_poly_vcoef_4t_1p0        	i0_poly_vcoef_4t_1p0;
	vid0_poly_vcoef_4t_1p1        	i0_poly_vcoef_4t_1p1;
	vid0_poly_vcoef_4t_2p0        	i0_poly_vcoef_4t_2p0;
	vid0_poly_vcoef_4t_2p1        	i0_poly_vcoef_4t_2p1;
	vid0_poly_vcoef_4t_3p0        	i0_poly_vcoef_4t_3p0;
	vid0_poly_vcoef_4t_3p1        	i0_poly_vcoef_4t_3p1;
	vid0_poly_vcoef_4t_4p0        	i0_poly_vcoef_4t_4p0;
	vid0_poly_vcoef_4t_4p1        	i0_poly_vcoef_4t_4p1;
	vid0_poly_vcoef_4t_5p0        	i0_poly_vcoef_4t_5p0;
	vid0_poly_vcoef_4t_5p1        	i0_poly_vcoef_4t_5p1;
	vid0_poly_vcoef_4t_6p0        	i0_poly_vcoef_4t_6p0;
	vid0_poly_vcoef_4t_6p1        	i0_poly_vcoef_4t_6p1;
	vid0_poly_vcoef_4t_7p0        	i0_poly_vcoef_4t_7p0;
	vid0_poly_vcoef_4t_7p1        	i0_poly_vcoef_4t_7p1;
} DSS_DU_VID0_REG_T;
#endif

