/*
 * SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
 * Copyright(c) 2013 by LG Electronics Inc.
 * 
 * This program is free software; you can redistribute it and/or 
 * modify it under the terms of the GNU General Public License 
 * version 2 as published by the Free Software Foundation.
 * 
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of 
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
 * GNU General Public License for more details.
 */

#include "reg_types.h"

#ifndef __VID1_UNION_REG_H
#define __VID1_UNION_REG_H


/*----------------------------------------------------------------------------
	0x31010000 vid1_rd_cfg0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_en                                           : 1; /* 0 */
		u32 src_dst_sel                                      : 1; /* 1 */
		u32 src_dual_op_en                                   : 1; /* 2 */
		u32 reserved3                                        : 1; /* 3 */
		u32 src_buf_sel                                      : 2; /* 5:4 */
		u32 src_trans_num                                    : 2; /* 7:6 */
		u32 src_sync_sel                                     : 2; /* 9:8 */
		u32 reserved7                                        : 2; /* 11:10 */
		u32 src_reg_sw_update                                : 1; /* 12 */
		u32 reserved9                                        :19; /* 31:13 */
	} af;
	u32 a32;
} vid1_rd_cfg0;

/*----------------------------------------------------------------------------
	0x31010004 vid1_rd_cfg1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_format                                       : 4; /* 3:0 */
		u32 src_byte_swap                                    : 2; /* 5:4 */
		u32 src_word_swap                                    : 1; /* 6 */
		u32 src_alpha_swap                                   : 1; /* 7 */
		u32 src_rgb_swap                                     : 3; /* 10:8 */
		u32 src_yuv_swap                                     : 1; /* 11 */
		u32 reserved6                                        : 2; /* 13:12 */
		u32 src_lsb_sel                                      : 1; /* 14 */
		u32 reserved8                                        : 2; /* 16:15 */
		u32 src_bnd_fill_mode                                : 1; /* 17 */
		u32 src_vscale_mode                                  : 1; /* 18 */
		u32 src_scl_bp_mode                                  : 1; /* 19 */
		u32 src_flip_mode                                    : 2; /* 21:20 */
		u32 reserved13                                       :10; /* 31:22 */
	} af;
	u32 a32;
} vid1_rd_cfg1;

/*----------------------------------------------------------------------------
	0x31010008 vid1_rd_cfg2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_fr_xd_re_path_sel                            : 1; /* 0 */
		u32 src_to_xd_re_path_sel                            : 1; /* 1 */
		u32 src_fr_xd_nr_path_sel                            : 1; /* 2 */
		u32 src_to_xd_nr_path_sel                            : 1; /* 3 */
		u32 reserved4                                        : 4; /* 7:4 */
		u32 vid_xd_path_en                                   : 1; /* 8 */
		u32 reserved6                                        :23; /* 31:9 */
	} af;
	u32 a32;
} vid1_rd_cfg2;

/*----------------------------------------------------------------------------
	0x31010028 vid1_rd_width_height
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_width                                        :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 src_height                                       :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid1_rd_width_height;

/*----------------------------------------------------------------------------
	0x3101002c vid1_rd_startxy
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_sx                                           :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 src_sy                                           :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid1_rd_startxy;

/*----------------------------------------------------------------------------
	0x31010030 vid1_rd_sizexy
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_sizex                                        :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 src_sizey                                        :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid1_rd_sizexy;

/*----------------------------------------------------------------------------
	0x31010038 vid1_rd_pip_sizexy
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_pip_sizex                                    :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 src_pip_sizey                                    :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid1_rd_pip_sizexy;

/*----------------------------------------------------------------------------
	0x3101003c vid1_rd_scale_ratioxy
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_x_ratio                                      :16; /* 15:0 */
		u32 src_y_ratio                                      :16; /* 31:16 */
	} af;
	u32 a32;
} vid1_rd_scale_ratioxy;

/*----------------------------------------------------------------------------
	0x31010040 vid1_rd_dss_base_y_addr0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_y0                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_rd_dss_base_y_addr0;

/*----------------------------------------------------------------------------
	0x31010044 vid1_rd_dss_base_u_addr0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_u0                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_rd_dss_base_u_addr0;

/*----------------------------------------------------------------------------
	0x31010048 vid1_rd_dss_base_v_addr0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_v0                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_rd_dss_base_v_addr0;

/*----------------------------------------------------------------------------
	0x3101004c vid1_rd_dss_base_y_addr1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_y1                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_rd_dss_base_y_addr1;

/*----------------------------------------------------------------------------
	0x31010050 vid1_rd_dss_base_u_addr1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_u1                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_rd_dss_base_u_addr1;

/*----------------------------------------------------------------------------
	0x31010054 vid1_rd_dss_base_v_addr1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_v1                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_rd_dss_base_v_addr1;

/*----------------------------------------------------------------------------
	0x31010058 vid1_rd_dss_base_y_addr2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_y2                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_rd_dss_base_y_addr2;

/*----------------------------------------------------------------------------
	0x3101005c vid1_rd_dss_base_u_addr2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_u2                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_rd_dss_base_u_addr2;

/*----------------------------------------------------------------------------
	0x31010060 vid1_rd_dss_base_v_addr2
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 src_st_addr_v2                                   :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_rd_dss_base_v_addr2;

/*----------------------------------------------------------------------------
	0x31010064 vid1_rd_status
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 rdmif_full_cmdfifo                               : 1; /* 0 */
		u32 rdmif_full_datfifo                               : 1; /* 1 */
		u32 reserved2                                        : 2; /* 3:2 */
		u32 rdmif_empty_cmdfifo                              : 1; /* 4 */
		u32 rdmif_empty_datfifo                              : 1; /* 5 */
		u32 reserved5                                        : 2; /* 7:6 */
		u32 rdbif_full_datfifo_y                             : 1; /* 8 */
		u32 rdbif_full_datfifo_u                             : 1; /* 9 */
		u32 rdbif_full_datfifo_v                             : 1; /* 10 */
		u32 reserved9                                        : 1; /* 11 */
		u32 rdbif_empty_datfifo_y                            : 1; /* 12 */
		u32 rdbif_empty_datfifo_u                            : 1; /* 13 */
		u32 rdbif_empty_datfifo_v                            : 1; /* 14 */
		u32 reserved13                                       : 1; /* 15 */
		u32 rdbif_con_state_y                                : 1; /* 16 */
		u32 rdbif_con_state_u                                : 1; /* 17 */
		u32 rdbif_con_state_v                                : 1; /* 18 */
		u32 rdbif_con_sync_state                             : 1; /* 19 */
		u32 rdbif_fmc_y_state                                : 1; /* 20 */
		u32 rdbif_fmc_uv_state                               : 1; /* 21 */
		u32 rdbif_fmc_sync_state                             : 1; /* 22 */
		u32 reserved21                                       : 1; /* 23 */
		u32 scl_vsc_wr_state                                 : 1; /* 24 */
		u32 scl_vsc_rd_state                                 : 1; /* 25 */
		u32 scl_hsc_wr_state                                 : 1; /* 26 */
		u32 scl_hsc_rd_state                                 : 1; /* 27 */
		u32 reserved26                                       : 4; /* 31:28 */
	} af;
	u32 a32;
} vid1_rd_status;

/*----------------------------------------------------------------------------
	0x31010190 vid1_wb_cfg0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_en                                            : 1; /* 0 */
		u32 wb_alpha_reg_en                                  : 1; /* 1 */
		u32 reserved2                                        : 2; /* 3:2 */
		u32 wb_buf_sel                                       : 1; /* 4 */
		u32 reserved4                                        : 3; /* 7:5 */
		u32 wb_sync_sel                                      : 2; /* 9:8 */
		u32 wb_reg_sw_update                                 : 1; /* 12 */
		u32 reserved7                                        :19; /* 31:13 */
	} af;
	u32 a32;
} vid1_wb_cfg0;

/*----------------------------------------------------------------------------
	0x31010194 vid1_wb_cfg1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_format                                        : 4; /* 3:0 */
		u32 wb_byte_swap                                     : 2; /* 5:4 */
		u32 wb_word_swap                                     : 1; /* 6 */
		u32 wb_alpha_swap                                    : 1; /* 7 */
		u32 wb_rgb_swap                                      : 3; /* 10:8 */
		u32 wb_yuv_swap                                      : 1; /* 11 */
		u32 reserved6                                        : 4; /* 15:12 */
		u32 wb_src_sel                                       : 1; /* 16 */
		u32 reserved8                                        :15; /* 31:17 */
	} af;
	u32 a32;
} vid1_wb_cfg1;

/*----------------------------------------------------------------------------
	0x310101b8 vid1_wb_alpha_value
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_alpha                                         : 8; /* 7:0 */
		u32 reserved1                                        :24; /* 31:8 */
	} af;
	u32 a32;
} vid1_wb_alpha_value;

/*----------------------------------------------------------------------------
	0x310101bc vid1_wb_width_height
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_width                                         :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 wb_height                                        :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid1_wb_width_height;

/*----------------------------------------------------------------------------
	0x310101c0 vid1_wb_startxy
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_sx                                            :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 wb_sy                                            :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid1_wb_startxy;

/*----------------------------------------------------------------------------
	0x310101c4 vid1_wb_sizexy
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_sizex                                         :13; /* 12:0 */
		u32 reserved1                                        : 3; /* 15:13 */
		u32 wb_sizey                                         :13; /* 28:16 */
		u32 reserved3                                        : 3; /* 31:29 */
	} af;
	u32 a32;
} vid1_wb_sizexy;

/*----------------------------------------------------------------------------
	0x310101cc vid1_wb_dss_base_y_addr0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_st_addr_y0                                    :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_wb_dss_base_y_addr0;

/*----------------------------------------------------------------------------
	0x310101d0 vid1_wb_dss_base_u_addr0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_st_addr_u0                                    :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_wb_dss_base_u_addr0;

/*----------------------------------------------------------------------------
	0x310101d8 vid1_wb_dss_base_y_addr1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_st_addr_y1                                    :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_wb_dss_base_y_addr1;

/*----------------------------------------------------------------------------
	0x310101dc vid1_wb_dss_base_u_addr1
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wb_st_addr_u1                                    :32; /* 31:0 */
	} af;
	u32 a32;
} vid1_wb_dss_base_u_addr1;

/*----------------------------------------------------------------------------
	0x310101e4 vid1_wb_status
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 wrctrl_full_inf_fifoy                            : 1; /* 0 */
		u32 wrctrl_full_inf_fifou                            : 1; /* 1 */
		u32 wrctrl_full_inf_fifov                            : 1; /* 2 */
		u32 reserved3                                        : 1; /* 3 */
		u32 wrctrl_empty_inf_fifoy                           : 1; /* 4 */
		u32 wrctrl_empty_inf_fifou                           : 1; /* 5 */
		u32 wrctrl_empty_inf_fifov                           : 1; /* 6 */
		u32 reserved7                                        : 1; /* 7 */
		u32 wrctrl_con_y_state                               : 1; /* 8 */
		u32 wrctrl_con_u_state                               : 1; /* 9 */
		u32 wrctrl_con_v_state                               : 1; /* 10 */
		u32 wrctrl_con_sync_state                            : 1; /* 11 */
		u32 wrmif_full_cmdfifo                               : 1; /* 12 */
		u32 wrmif_full_datfifo                               : 1; /* 13 */
		u32 reserved14                                       : 2; /* 15:14 */
		u32 wrmif_empty_cmdfifo                              : 1; /* 16 */
		u32 wrmif_empty_datfifo                              : 1; /* 17 */
		u32 reserved17                                       :14; /* 31:18 */
	} af;
	u32 a32;
} vid1_wb_status;

/*----------------------------------------------------------------------------
	0x31010500 vid1_poly_hcoef_12t_0p0
----------------------------------------------------------------------------*/
typedef union {
	struct {
		u32 pp_0p_m5_hcoef                                   : 9; /* 8:0 */
		u32 pp_0p_m4_hcoef                                   : 9; /* 17:9 */
		u32 pp_0p_m3_hcoef                                   : 9; /* 26:18 */
		u32 reserved3                                        : 5; /* 31:27 */
	} af;
	u32 a32;
} vid1_poly_hcoef_12t_0p0;

/*----------------------------------------------------------------------------
	0x31010504 vid1_poly_hcoef_12t_0p1
----------------------------------------------------------------------------*/
typedef union {
	struct {
